[
  {
    "id": 1,
    "title": "Server component for face comparison system",
    "text_ru": "В результате развития информационных технологий и их громадной пользы в работе человека сегодня уже практически невозможно встретить организацию, в которой они отсутствуют или применяются в ограниченном масштабе. Но несмотря на огромный вклад в человеческую повседневность они влекут за собой огромное количество новых угроз. Одной из самой вредных и неприятных угроз для организаций является утечка данных, поскольку она подрывает доверие потребителя и потенциально может привести к закрытию бизнеса. Подобную проблему также встречают образовательные организации, использующие в своей работе приложения на базе платформы 1C. Решением данной проблемы является усложнение механизма авторизации – добавление в него еще одного шага в виде распознавания лиц. Для ее конструирования оптимальным образом необходимо спроектировать архитектуру с учетом актуальных на текущий момент бизнес-требований образовательных организаций и разработать программный прототип готовый к интеграции в текущие программные образовательные решения. В статье приводится пример вышеуказанной архитектуры и приложения на ее базе, которые в дальнейшем могут быть интегрированы в любую систему на базе 1С: Предприятие.",
    "text_en": "As a result of the development of information technologies and their enormous usefulness in human work, it is now almost impossible to find an organization without them or with limited use of them. But despite their enormous contribution to human daily life, they entail a huge number of new threats. One of the most harmful and unpleasant threats to organizations is data breaches, as they undermine consumer confidence and can potentially lead to business closure. Educational organizations that use applications based on the 1C platform in their work also face a similar problem. The solution to this problem is to complicate the authorization mechanism by adding another step to it in the form of facial recognition. To design it in an optimal way it is necessary to design the architecture taking into account the current business requirements of educational organizations and to develop a software prototype ready for integration into current educational software solutions. The article gives an example of the above architecture and applications based on it, which can be further integrated into any system based on 1C: Enterprise."
  },
  {
    "id": 2,
    "title": "Changing face contours reduces the inversion effect and overall recognition performance",
    "text_ru": "В работе «Changing face contours reduces the inversion effect and overall recognition performance», авторы экспериментируют с изменением входных данных в модели для того чтобы побороть эффект инверсии (эффект инверсии — это проблема, связанная с более долгим распознаванием лиц на изображении полностью инвертированных в другую сторону, в отличие от стандартного вертикального положения лица на изображении). В ходе нескольких экспериментов с входными данными они пришли к выводу, что в случае изменение контура лица определенным образом (например, размытие контуров) эффект инверсии можно побороть ценой небольшого снижения качества модели на вертикальных изображениях",
    "text_en": "In \"Changing face contours reduces the inversion effect and overall recognition performance\", the authors experiment with changing the input data to the model in order to overcome the inversion effect (the inversion effect is a problem associated with longer recognition of faces in an image completely inverted to the other side, as opposed to the standard vertical position of the face in the image). Through several experiments with the input data, they concluded that in the case of changing the contour of the face in a certain way (e.g., blurring the contours), the inversion effect can be overcome at the cost of a small decrease in the quality of the model in vertical images"
  },
  {
    "id": 3,
    "title": "Deep-learning based descriptors in application to aging problem in face recognition",
    "text_ru": "В работе «Deep-learning based descriptors in application to aging problem in face recognition» авторы анализируют несколько пред тренированных нейронных сетей и приходят к выводу, что наиболее перспективной в решении проблемы распознавания стареющих лиц является предтренированная глубокая CNN модель.",
    "text_en": "In \"Deep-learning based descriptors in application to aging problem in face recognition\", the authors analyze several pre-trained neural networks and conclude that the pre-trained deep CNN model is the most promising in solving the aging face recognition problem."
  },
  {
    "id": 4,
    "title": "Face recognition",
    "text_ru": "В рамках python-разработки наиболее важным является интеграция инструментов машинного обучения. Основной для распознавания лиц будет является модуль «face_recognition», основанный на Dlib, библиотеке уже имеющей предтренированые модели**. В частности, в случае распознавания лиц используется предтренированая сверхточная нейронная сеть для извлечения эмбеддингов ResNet, основанная на датасете из 3 миллионов лиц, имеющая точность 99.38% на бенчмарке «Labeled Faces in the Wild Home»***. Данный тип нейронных сетей уже доказал свою эффективность, так, например, он используется при классификации космических снимков. Помимо этого, сама библиотека уже проходила тестирование в других работах и показала достойные результаты.",
    "text_en": "Within python development, the most important is the integration of machine learning tools. The main one for face recognition will be the \"face_recognition\" module based on Dlib, a library already having pre-trained models**. In particular, in the case of face recognition, a pre-trained ultra-accurate neural network is used to extract ResNet embeddings, based on a dataset of 3 million faces, with an accuracy of 99.38% on the \"Labeled Faces in the Wild Home \"*** benchmark. This type of neural network has already proven its effectiveness, for example, it is used in the classification of space images. In addition, the library itself has already been tested in other works and has shown decent results."
  }
]